tutorials/SandiaD/0.org/chi
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      chi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    jet
    {
        type            zeroGradient;
    }
    pilot
    {
        type            zeroGradient;
    }
    coflow
    {
        type            zeroGradient;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            slip;
    }
    outerWall
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
