tutorials/SandiaD/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    jet
    {
        type            calculated;
        value           uniform 0;
    }
    pilot
    {
        type            calculated;
        value           uniform 0;
    }
    coflow
    {
        type            calculated;
        value           uniform 0;
    }
    outflow
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            calculated;
        value           uniform 0;
    }
    outerWall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
