tutorials/SandiaD/0.org/rho
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.21731;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    jet
    {
        type            fixedValue;
        value           uniform 1.08147;
    }
    pilot
    {
        type            fixedValue;
        value           uniform 0.178466;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 1.21731;
    }
    outerWall
    {
        type            zeroGradient;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
