tutorials/SandiaD/constant/flamelet/chi
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarList;
    object      chi;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    1.0000000e+00
    1.3750000e+00
    2.5000000e+00
    3.1250000e+00
    5.0000000e+00
    1.0000000e+01
    1.5000000e+01
    2.0000000e+01
    3.0000000e+01
)

// *********************** vim: set ft=cpp et sw=4 : *********************** //
