tutorials/SandiaD/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture // air at room temperature (293 K)
{
    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cp          1005;
        Hf          0;
    }
    transport
    {
        mu          1.82e-05;
        Pr          0.71;
    }
}

mcThermoCloudProperties
{
    velocityModel      SLMFull;
    positionCorrection limitedSimple;
    localTimeStepping  cell;
    OmegaModel         RAS;
    mixingModel        IEM;
    reactionModel      SteadyFlamelet;
    scalarFields       ( z chi T );
    mixedScalars       ( z );
    conservedScalars   ( z );
    SteadyFlameletReactionModelCoeffs
    {
      scalars ( T );
    }
    boundaryHandlers
    {
        jet
        {
            type            inletOutlet;
            randomGenerator
            {
                type        inversion;
            }
        }
        coflow
        {
            type            inletOutlet;
            randomGenerator
            {
                type        inversion;
            }
        }
        outflow
        {
            type            inletOutlet;
            randomGenerator
            {
                type        inversion;
            }
        }
        pilot
        {
            type            inletOutlet;
            randomGenerator
            {
                type        inversion;
            }
        }
        axis
        {
            type            slip;
        }
        outerWall
        {
            type            slip;
        }
        front
        {
            type            empty;
        }
        back
        {
            type            empty;
        }
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
