tutorials/SandiaD/system/blockMeshDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

/*****************************************************************************\
   3                                                     7
    +----------------------------------------------------+
    \----___      11                                      \----___
     \      ---__+_________________________________________\___________+ 15
      \          /                                          \          /
     2 +        + 10                                       6 +        + 14
        \      /                                              \      /
       1 +    + 9                                            5 +    + 13
          \  /                                                  \  /
         0 ++-8------------------------------------------------4-++ 12
\*****************************************************************************/

convertToMeters 1e-3;

vertices
(
    (           0    0.1494292  -0.01307336) //  0
    (           0     3.586301   -0.3137607) //  1
    (           0     8.894026   -0.7781265) //  2
    (           0     149.4292    -13.07336) //  3
    (         800    0.1494292  -0.01307336) //  4
    (         800     3.586301   -0.3137607) //  5
    (         800     8.894026   -0.7781265) //  6
    (         800     149.4292    -13.07336) //  7
    (           0    0.1494292   0.01307336) //  8
    (           0     3.586301    0.3137607) //  9
    (           0     8.894026    0.7781265) //  10
    (           0     149.4292     13.07336) //  11
    (         800    0.1494292   0.01307336) //  12
    (         800     3.586301    0.3137607) //  13
    (         800     8.894026    0.7781265) //  14
    (         800     149.4292     13.07336) //  15
);

blocks
(
    hex ( 0  8 12  4  1  9 13  5) (1 54  8) simpleGrading (1 15 2)
    hex ( 1  9 13  5  2 10 14  6) (1 54  6) simpleGrading (1 15 2)
    hex ( 2 10 14  6  3 11 15  7) (1 54 20) simpleGrading (1 15 8)
);

edges
(
);

patches
(
    wedge front
    (
        ( 8 12 13  9)
        ( 9 13 14 10)
        (10 14 15 11)
    )
    wedge back
    (
        ( 0  1  5  4)
        ( 1  2  6  5)
        ( 2  3  7  6)
    )
    patch jet
    (
        ( 0  8  9  1)
    )
    patch pilot
    (
        ( 1  9 10  2)
    )
    patch coflow
    (
        ( 2 10 11  3)
    )
    patch outerWall
    (
        ( 3 11 15  7)
    )
    patch outflow
    (
        ( 4  5 13 12)
        ( 5  6 14 13)
        ( 6  7 15 14)
    )
    patch axis
    (
        ( 0  4 12  8)
    )
);

// *********************** vim: set ft=cpp et sw=4 : *********************** //
