tutorials/SandiaD/system/mcThermoCloudSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/mcThermoCloudSolution";
    object      mcSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CFL                     0.3;
averagingCoeff          2e4;
particlesPerCell        40;
particleNumberControl   on;
cloneAt                 0.8;
eliminateAt             1.2;
kMin                    1e-8;
DNum                    0.05;

RASOmegaModelCoeffs
{
    Omega0              1e5;
}

cellLocalTimeSteppingCoeffs
{
    upperBound        50;
}

limitedSimplePositionCorrectionCoeffs
{
    C               5e-2;
}

relaxationTimes
{
    default         1e11;
    k               1e-5;
    U               1e-5;
}

interpolationSchemes
{
        mcRASOmegaModel::Omega       cellPointFace;
        rho                          cellPointFace;
        U                            cellPointFace;
        k                            cellPointFace;
        SLMFullVelocityModel::diffU  cellPointFace;
        kCloudPDF                    cellPointFace;
        UPosCorr                     cellPointFace;
        zzCov                        cellPointFace;
        mcCellLocaltimeStepping::eta cellPointFace;
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
